#### Terraform Plan for development
---
#### Terraform Format and Style 🖌`skipped`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.node_id: Refreshing state... [id=3Rg]
data.aws_ami.server_ami: Reading...
aws_iam_role.vpc-fl: Refreshing state... [id=cashewhands-vpc-fl]
aws_vpc.vpc: Refreshing state... [id=vpc-07193208af8312cf9]
aws_s3_bucket.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_s3_bucket_versioning.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_s3_bucket_public_access_block.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_s3_bucket_server_side_encryption_configuration.example: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_iam_role_policy.vpc-fl: Refreshing state... [id=cashewhands-vpc-fl:flow-log-policy]
aws_security_group.webserver_sg: Refreshing state... [id=sg-05f49d53b4daf680a]
aws_flow_log.vpc-fl: Refreshing state... [id=fl-097e889adf8ad8575]
data.aws_ami.server_ami: Read complete after 2s [id=ami-01d08089481510ba2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_flow_log.vpc-fl must be replaced
-/+ resource "aws_flow_log" "vpc-fl" {
      ~ arn                      = "arn:aws:ec2:us-east-1:012119841372:vpc-flow-log/fl-097e889adf8ad8575" -> (known after apply)
      + iam_role_arn             = "arn:aws:iam::012119841372:role/cashewhands-vpc-fl" # forces replacement
      ~ id                       = "fl-097e889adf8ad8575" -> (known after apply)
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      + log_group_name           = (known after apply)
      - tags                     = {} -> null
      ~ vpc_id                   = "vpc-07193208af8312cf9" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

  # aws_instance.webserver will be created
  + resource "aws_instance" "webserver" {
      + ami                                  = "ami-01d08089481510ba2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "34bab59199daf5245dcd538c46b61435fff39fe8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.webserver_sg must be replaced
-/+ resource "aws_security_group" "webserver_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:012119841372:security-group/sg-05f49d53b4daf680a" -> (known after apply)
      ~ id                     = "sg-05f49d53b4daf680a" -> (known after apply)
        name                   = "webserver-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "012119841372" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-07193208af8312cf9" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_vpc.vpc must be replaced
-/+ resource "aws_vpc" "vpc" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:012119841372:vpc/vpc-07193208af8312cf9" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.20.0.0/16" -> "10.0.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-060186e1716b90d74" -> (known after apply)
      ~ default_route_table_id               = "rtb-01257b1410bf06547" -> (known after apply)
      ~ default_security_group_id            = "sg-03f6c242b40a8ccbd" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0746b9de053134adb" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = true -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-07193208af8312cf9" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-01257b1410bf06547" -> (known after apply)
      ~ owner_id                             = "012119841372" -> (known after apply)
      - tags                                 = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @cashewhands, Action: `pull_request`*